<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    <%-- 주석 추가하기 --%>
    <%--
             자바 스크립트에서 공부할 부분)
             
             1. 변수 : let(변수) , const(상수)
             2. 자료형 종류 : number, string, boolean, null, function, object, undefined
             3. 연산자
             4. 제어믄 : 조건문, 반복문, 반복 제어문
             5. 함수
             6. 배열, 객체 => JSON
             ===================================================== 여기까지가 기본 문법
             7. 태그 제어 : HTML 화면제어 => DOM
             8. 이벤트
             9. 비동기 : async, await => Promise
             ===================================================== 여기까지를 바닐라JS 라고 함
             10. 라이브러리
             11. vue3 => Pinia / vuex => NuxtJS
             12. 주석 추가하기
             
     ==================================================================================        
             프론트의 웹구성)
             1. HTML : 웹페이지 구조              
             2. CSS  : 디자인 / 스타일 변경
             3. 자바스크립트 : 동작 및 기능 처리 => 데이터 처리
            => 전체 기반은 html로 구성해야한다 => html은 브라우저에서 실행하는 언어이다 
      ================================================================================
      자바스크립트의 특징)
      
      1. 인터프리터를 갖고 있다 => 컴파일을 하지 않는다 => 한줄씩 읽어서 출력
         => 에러처리가 어려움 => 그래서 개발자 도구를 이용해 에러처리함
         
      2. 동적 페이지 => 화면 변경이 없이 그자리에서 처리
      
      3. 비동기 처리가 가능함   
      ================================================================================
      사용처)
      
      1. 웹개발에 주로 사용 => 동적처리 방식이 많이 사용됨
         (예 : 로그인처리 / 팝업창 띄우기 / 아이디 중복/ 우편번호 검색 ..../ 검색 / 서제스트(자동완성))
         
      2. 백엔드 개발에서도 사용됨 => 서버로 사용됨(Node JS)
      3. 모바일에서도 사용이 가능 => React Navtive
      4. 데스크탑 애플리케이션도 가능함 => VsCode / VuErd
      5. 게임 개발, 실시간 채팅(화상), AI   
      ==============================================================================                  
      어떤 언어인지)
      => HTML 과 CSS로 구성된 웹페이지를 동적으로 변경해주는 역할을 수행하는 언어
      => HTML,CSS는 데이터 변경을 할 수 없음(정적 페이지)
      ==============================================================================
      동작방법)
      
      1. 내부 script
           <head>
            <script>
               처리
            </script>
           </head>
            
      2. 외부 script
          .js 파일을 만들어서 처리
          <script src ="파일명">
          
      3. 인라인 script
           태그 자체 처리
           <button onclick="javascript:hostory.back()">
           
      4. 기타 자바스크립트 처리
         1) windows.onload=function(){처리}
         2) jquery : $(function(){처리})
         3) vue :
         4) react :   
    ==================================================================================
    따라서 자바스크립트란?
    => 웹브라우저에서 동작하는 스크립트 언어
    => 용도 : 동벅 페이지 제작, 서버 개발, 앱 개발
    => 실행 환경 : 브라우저에서 실행
    => 특징 : 인터프리터, 객체 기반, 이벤트 중심
    
    ==================================================================================
 
    기본 문법)
    1. 변수 : 한개의 데이터를 저장하는 공간 => 대신 데이터형이 없고, 값을 대입하면 자동으로 데이터형 인식함
           => ES5 : var 
           => ES6 : let, const
           => 예  : let a = 10 => a: int 혹은 a:number 라는 의미
                    정수랑 실수 모두 숫자형이다     
          => 주석 추가
          
          ========================================================================
          var => scope 라고 해서 사용범위가 명확하지 않음 => 그래서 메모리 누수현상 발생함 
          let => 사용범위가 명확, 블록을 벗어나면 바로 사라진다
          const => 서버에서 값을 받는 경우 => 'final'이라고도 함
     =================================================================================
     변수의 단점)
     
     => 데이터형 확인이 어렵다               
        예 : 주석과 같이 이런식으로 계속 바뀔 수가 있어서 데이터형이 뭔지 파악이 어렵다 => 가독성이 떨어짐
            값만 대입하면 데이터형 변경이 가능하다 
            => 이런 단점을 보완하기 위해 데이터를 지정하는 '타입스크립트'를 사용
            
            예 :  주석 추가 => a라는 변수는 지정이 됐기 때문에 다른 데이터형으로 사용이 불가능햊진다
            
   =======================================================================================         
      자바스크립트에서 제공하는 데이터형)
      
      1. 기본형 : number, string, boolean, null, undefined, bigint(long)
      2. 참조형 : object, array, function
                => function을 데이터형으로 취급함
                => 매개변수로 사용이 가능  
     => 데이터형을 확인할 때는 : typeof    
      3. 형변환 :
      
   =========================================================================================
   자바스크립트 ============================ 오라클
              -> 노드js를 제외하고는 직접 연결이 어려움
              -> 그래서 자바(mvc / spring / spring-boot )를 한번 거치고 오라클과 연결한다
              
  ===========================================================================================                     
     --%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<script type="text/javascript">

// 스크립트 안에서 주석처리 주의하자( 한줄 주석은 // )
/*
 * 여러줄 주석 처리
 */
 
 // 자바스크립트에서 자동실행되는 함수 => main
 window.onload=function()
 {
	 // 자바스크립트 데이터형 정리)
	 
    /*
        프로그램에 필요한 변수 선언울 하기 위해 알아야 할 내용)
        
        변수 선언 : var / let(ES6버전을 권장) / const
        
        식별자   : 알파벳으로 시작 => 대소문자 구분
                 숫자 사용이 가능함 => 맨앞 사용은 불가능
                 공백을 주면 안 됨
                 뮨자열 길이는 상관이 없음(몇글자를 쓰는 괜찮디)
                 키워드 사용이 금지
                 특수문자는 _(언더바)와 $만 사용이 가능
                 
       이전코딩 => let a=10; 이렇게 ;를 사용
       최근    => ;을 생략이 가능 => let a=10
      
       출력하는 형태)
            1. console.log(변수) => 개발자 도구를 이용한다 (명령 프롬프트)
               system.out.println()
               
            2. document.write(출력)
    */
    
    // typeof을 이용해 데이터형 확인
    let a=10
    let b=10.5
    let c="HELLO Java Script"
    let d='HELLO Java Script'
    let e=[1,2,3,4,5]
    let f={"name":"홍길동","age":20}
    let g=function(){}
    let m;
    let k=true
   
    
    console.log("a="+a+",type="+ typeof a)
    console.log("b="+b+",type="+ typeof b)
    console.log("c="+c+",type="+ typeof c)
    console.log("d="+d+",type="+ typeof d)
    console.log("e="+e+",type="+ typeof e)
    console.log("f="+f+",type="+ typeof f)
    console.log("g="+g+",type="+ typeof g)
    console.log("m="+m+",type="+ typeof m)
    console.log("k="+k+",type="+ typeof k)

    // 변수값 변경
    let aa="HELLO JavaSvrioskfn"
    aa="Hello nalksflksklfjnhlk"
    console.log("aa="+aa) // 문자열 결합
    
    let bb=10
    let bb=20
    console.log("bb="+bb)
    // let 변수는 var의 단점을 보완해주기에 기본으로 쓰기를 권장
    // 대신 가독성이 떨어지고, 데이터형 파악이 어려움
    
    let cc=10
    cc="hello"
    cc='Hello Javas'
    cc=[1,2,3,4,5]
    cc={"name":"hong","age":18}
    cc=true
    cc=function(){}
    
    
    const dd=10;
    dd="hello js"
    console.log("dd="+dd)
    // 상수는 값을 하나만 지정해야 한다
 }
 // 여기까지 데이터형에 대해 배움
 
   // 괄호 밖에서는 let 변수 사용 안됨
   // 다만 콘솔은 경우에 따라 괄호 즉, 블록 밖에서도 사용 가능함
   // 지금 경우에는 블록 안에 변수 선언을 출력하기 위함으로 콘솔이 블록 안에 들어감
   // 브라우저에서 도구 더보기 - 개발자 도구에서 데이터형 확인이 가능하다
 
 
</script>
</head>
<body>

</body>
</html>