<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
       [오늘 배울 내용]
      1. cookie 사용법
      2. Session 사용법  // 12장
      3. FileUpload    // 13장
      4. ConnectionPool
      
  X ** 표시는 실무에서 특히나 많이 사용하는 부분이라 무조건 외워야 한다    
---------------------------------------------------------------
JSP의 장점 :
            HTML 변경이 가능함 -> 데이터 변경이 가능해짐 -> 한 파일에서 여러개를 수행 가능 => 동적페이지
            
JSP의 단점 : 화면 출력은 HTML, 데이터 변경은 자바로 하기 때문에 작업이 복잡 , 분리할 수 X , 여러명이 동시 작업이 불가능     

------------------------------------------------------------------------------------------------
JSP 짜는 순서

1. JSP 지시자를 설정 => 지시자는 전체 설정을 담당하는 태그임
   : 
     1) page : JSP 페이지 속성을 설정하는 태그
               이 안에는 1) contentType : 브라우저로 응답 **
                                        text/html => default
                                         -> 그냥 적으면 한글이 꺠지니 text/html;charset=UTF-8을 추가한다
                                        text/xml
                                        text/plain
                       2) import :라이브러리 / 사용자 클래스 읽기 **
                       3) errorPage : 오류가 발생하면 이동 페이지
                       4) buffer : HTML을 출력하는 메모리 공간 크기 => 8kb  
                                      
     2) taglib : 자바의 기본 제어문이나 String클래스, 날짜변환이나 숫자 변환은 태그형으로 만들어져 있는데 이들은  <% %>를 사용하지 않게 만든다
                 종류) 
                     <c:forEach> ...... 주석 추가하기
                 => 클래스 자체를 태그형으로 바꿔놨다(이미 자바에서 제작해놨다)
--------------------------------------------------------------------------------------------------------------------------                 
 2. JSP 내장객체 : 미리 생성된 (이미 만들어진) 객체 => 자동으로 제공하는 객체임
    종류) 
         request : 클라이언트 요청 정보 => 사용자 전송 데이터를 담은 클래스 **
         response : 응답하는 클래스 (HTML, Cookie) **
         session : 사용자당 1개만 생성  후 서버에 저장 **
                   object단위로 저장이 가능
                   보안이 굿
                   로그인 / 장바구니를 만들 때 사용
         application : 전체 내용을 관리 // 여기까지 실무에서 자주 사용
         out         : 출력 버퍼를 관리
         pageContext : <jsp:include> <jsp:forward>      
         Cookie      : 클라이언트 브라우저에 저장 , 보안이 약함, 만료시간 설정, 문자열만 저장이 가능  
                       로그인 유지, 최근 방문, 자동 로그인을 만들 때 사용
                       자동 로그인을 만들 떄는 반드시 비밀번호를 암호화 시켜야 한다      
---------------------------------------------------------------------------------------------
오늘 베우는 내용(p.151)
1. 액션 태그
   : <jsp:include> **
     <jsp:forward>
     <jsp: useBean> **
     <jsp:setProperty> ** 
     
2. 자바빈즈
   : VO / DTO와 같음
    데이터를 모아서 전송한다.
    JSP에서는 빈이라고 부름
    데이터 보호를 위해 캡슐화를 한다
    데이터 은닉화를 함
    변수에 기능 부여함 => 읽기 / 쓰기를 이용(메소드:getter / setter)
    변수 : private으로 설정                             
    제작방식) 
           private String name;
           => 읽기 기능을 주려면
              public String getName() 이렇게 처리한다
           ---------------------------------------
           getXxx() 이렇게 변수를 잡아준다   
    --%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>

</body>
</html>