<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    <%--
       fixed : 고정 => 퀵메뉴 혹은 메뉴를 만들 때 사용
                   => 최근 방문 = cookie
     --%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<style type="text/css">
.content{
 width: 450px;
 
}
#image{
 position :fixed;
 top: 50px;
 right: 300px;
 width: 300px;
 height: 200px;
}
</style>
</head>
<body>
 <img src="../images/m1.jpg" id="image">
 <div class="content">
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
  <p>
  유럽 축구 이적시장 소식에 능통한 파브리지오 로마노 기자는 18일(한국시간) 
  "마이클 캐릭 감독과 맨유의 새로운 계약이 예상대로 완료됐다. 
  계약은 2028년 6월까지 유효하다. 2029년까지 연장 옵션이 포함됐다"라고 전했다.
  </p>
 </div>
</body>
</html>